In [57]:
import numpy as np
import pandas as pd

In [58]:
"""
TOPICS:
Pandas operations : 
    unique() -only choose unique values in the given column
    nunique() - number of unique values in the given column
    value_counts() -freq of unique values
    drop_duplicates()
    appply(function_name) - apply a given mehtod on dataframe
    map(dict) -map the given column values as per the input dictionary
    max() - max value in the given column
    idxmax() - max value index in the given column
    columns
    columns = list -reassign column lables as per the list
    sort_values('col', ascending = False)
    concat([df1, df2], axis = 1) -concatenate two dataframes along the given axis
    get_dummies(df['col']) - one hot encoding

"""

"\nTOPICS:\nPandas operations : \n    unique() -only choose unique values in the given column\n    nunique() - number of unique values in the given column\n    value_counts() -freq of unique values\n    drop_duplicates()\n    appply(function_name) - apply a given mehtod on dataframe\n    map(dict) -map the given column values as per the input dictionary\n    max() - max value in the given column\n    idxmax() - max value index in the given column\n    columns\n    columns = list -reassign column lables as per the list\n    sort_values('col', ascending = False)\n    concat([df1, df2], axis = 1) -concatenate two dataframes along the given axis\n    get_dummies(df['col']) - one hot encoding\n\n"

In [59]:
df= pd.DataFrame({  'k1':['A','A','B','B','C','C'],
                    'col1':[100,200,300,300,400,500],
                    'col2':['NY','CA','WA','WA','AK','NV']})
df

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [60]:
#unique values in the given column
df['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [61]:
#count number of unique values in the given column
df['k1'].nunique()

3

In [62]:
#freq of unique values in the given column
df['k1'].value_counts()

A    2
B    2
C    2
Name: k1, dtype: int64

In [63]:
#drop duplicate rows from the given dataframe
df.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [64]:
#apply a given mehtod on dataframe
def fun_sqr(x):
    return x**2
df['col1'].apply(fun_sqr)

0     10000
1     40000
2     90000
3     90000
4    160000
5    250000
Name: col1, dtype: int64

In [65]:
# map the given column values as per the input dictionary
df['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [66]:
map_dict = {'A': '1', 'B':'2', 'C':'3'} 
df['k1'].map(map_dict)

0    1
1    1
2    2
3    2
4    3
5    3
Name: k1, dtype: object

In [67]:
#max value in the given column
df['col1'].max()

500

In [68]:
#max value index in the given column
df['col1'].idxmax()

5

In [69]:
#display columns labels
df.columns

Index(['k1', 'col1', 'col2'], dtype='object')

In [70]:
#rename column labels as per the given list
df.columns = ['c1', 'c2', 'c3']
df

  c1   c2  c3
0  A  100  NY
1  A  200  CA
2  B  300  WA
3  B  300  WA
4  C  400  AK
5  C  500  NV

In [71]:
#sort values in the given column
df['c2'].sort_values() #by default ascending = True

0    100
1    200
2    300
3    300
4    400
5    500
Name: c2, dtype: int64

In [72]:
#sort values in the given column
df['c2'].sort_values(ascending = False) #by default ascending = True

5    500
4    400
3    300
2    300
1    200
0    100
Name: c2, dtype: int64

In [73]:
#concatanate two dataframes along the given axis
df2 = pd.DataFrame({'prob' : [0.3, 0.86, 0.9, 0.1]})
pd.concat([df, df2], axis = 1) # concatenate along columns

  c1   c2  c3  prob
0  A  100  NY  0.30
1  A  200  CA  0.86
2  B  300  WA  0.90
3  B  300  WA  0.10
4  C  400  AK   NaN
5  C  500  NV   NaN

In [74]:
#one-hot encoding
c = pd.get_dummies(df['c1'])
c

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

In [75]:
df = pd.concat([df, c], axis = 1)
df

  c1   c2  c3  A  B  C
0  A  100  NY  1  0  0
1  A  200  CA  1  0  0
2  B  300  WA  0  1  0
3  B  300  WA  0  1  0
4  C  400  AK  0  0  1
5  C  500  NV  0  0  1

In [76]:
df = df.drop('c1', axis = 1)
df

    c2  c3  A  B  C
0  100  NY  1  0  0
1  200  CA  1  0  0
2  300  WA  0  1  0
3  300  WA  0  1  0
4  400  AK  0  0  1
5  500  NV  0  0  1